# -*- coding: utf-8 -*-

CITIES = {
    "а": {
        "Абакан",  # росія
        "Ангарськ",  # росія
        "Армавір",  # росія
        "Архангельськ",  # росія
        "Астрахань",  # росія
        "Ачинськ",  # росія
    },
    "б": {
        "Балаково",  # росія
        "Балашиха",  # росія
        "Барнаул",  # росія
        "Берестя",  # білорусь
        "Брест",  # білорусь
        "Білгород",  # росія
        "Бобруйськ",  # білорусь
        "Братськ",  # росія
        "Брянськ",  # росія
    },
    "в": {
        "Вітебськ",  # білорусь
        "Владивосток",  # росія
        "Владикавказ",  # росія
        "Владимир",  # росія
        "Волгоград",  # росія
        "Волзький",  # росія
        "Вологда",  # росія
        "Воронеж",  # росія
    },
    "г": {
        "Гомель",  # білорусь
        "Грозний",  # росія
    },
    "д": {
        "Дербент",  # росія
        "Дігора",  # росія
    },
    "е": {
        "Еліста",  # росія
    },
    "є": {
        "Єлець",  # росія
        "Єсентуки",  # росія
    },
    "ж": {
        "Жуковський",  # росія
    },
    "з": {
        "Заречний",  # росія
        "Зеленоград",  # росія
        "Златоуст",  # росія
    },
    "і": {
        "Іваново",  # росія
        "Іжевськ",  # росія
        "Ірбіт",  # росія
        "Іркутськ",  # росія
    },
    "й": {
        "Йошкар-Ола",  # росія
    },
    "к": {
        "Казань",  # росія
        "Калінінград",  # росія
        "Калуга",  # росія
        "Кемерово",  # росія
        "Кіров",  # росія
        "Кострома",  # росія
        "Краснодар",  # росія
        "Красноярськ",  # росія
        "Купіно",  # росія
        "Курган",  # росія
        "Курськ",  # росія
    },
    "л": {
        "Липецьк",  # росія
    },
    "м": {
        "Магадан",  # росія
        "Майкоп",  # росія
        "Махачкала",  # росія
        "Мінськ",  # білорусь
        "Мічурінськ",  # росія
        "Москва",  # росія
        "Мурманськ",  # росія
    },
    "н": {
        "Набережні Челни",  # росія
        "Назрань",  # росія
        "Находка",  # росія
        "Нерехтя",  # росія
        "Нефтеюганськ",  # росія
        "Нижній Новгород",  # росія
        "Нижній Тагіл",  # росія
        "Нижньовартовськ",  # росія
        "Нижньокамськ",  # росія
        "Новокузнецьк",  # росія
        "Новомосковськ",  # росія
        "Новоросійськ",  # росія
        "Новосибірськ",  # росія
        "Норильськ",  # росія
    },
    "о": {
        "Обнінськ",  # росія
        "Одинцово",  # росія
        "Омськ",  # росія
        "Орел",  # росія
        "Оренбург",  # росія
        "Орськ",  # росія
    },
    "п": {
        "П'ятигорськ",  # росія
        "Пенза",  # росія
        "Перм",  # росія
        "Петрозаводськ",  # росія
        "Петропавловськ-Камчатський",  # росія
        "Подольськ",  # росія
    },
    "р": {
        "Реутов",  # росія
        "Ростов-на-Дону",  # росія
        "Рубцовськ",  # росія
        "Ряжськ",  # росія
        "Рязань",  # росія
    },
    "с": {
        "Салават",  # росія
        "Самара",  # росія
        "Саранськ",  # росія
        "Саратов",  # росія
        "Смоленськ",  # росія
        "Сочі",  # росія
        "Ставрополь",  # росія
        "Старий Оскол",  # росія
        "Сургут",  # росія
        "Санкт-Петербург",  # росія
    },
    "т": {
        "Таганрог",  # росія
        "Тольятті",  # росія
        "Томськ",  # росія
        "Туапсе",  # росія
        "Тула",  # росія
        "Тюмень",  # росія
    },
    "у": {
        "Улан-Уде",  # росія
        "Ульяновськ",  # росія
        "Уссурійськ",  # росія
        "Уфа",  # росія
    },
    "х": {
        "Хабаровськ",  # росія
        "Ханти-Мансійськ",  # росія
        "Хасав'юрт",  # росія
        "Хілок",  # росія
    },
    "ч": {
        "Чебоксари",  # росія
        "Челябінськ",  # росія
        "Череповець",  # росія
        "Чита",  # росія
        "Чкаловськ",  # росія
    },
    "ш": {
        "Шахти",  # росія
    },
    "щ": {
        "Щолково",  # росія
    },
    "ю": {
        "Южно-Курильськ",  # росія
        "Южно-Сахалінськ",  # росія
        "Южно-Сухокумськ",  # росія
        "Южноуральськ",  # росія
        "Юрга",  # росія
    },
    "я": {
        "Якутськ",  # росія
        "Ялуторівськ",  # росія
        "Ярославль",  # росія
        "Ярцево",  # росія
        "Ясногорськ",  # росія
    },
}

if __name__ == "__main__":
    from games.cities.utils import normalised

    for key, value in normalised(CITIES).items():
        print(f"{key}: {value}")
